{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "39"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Reshape_2/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Reshape_2/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_2/multiples/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_2/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "128"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_1/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_1/multiples/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_1/multiples/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_3/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_3/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/linear/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "41"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/linear/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/linear/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/linear/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/linear/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/linear/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/linear/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/linear/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/linear/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/linear/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/linear/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/linear/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/linear/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/linear/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/linear/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/linear/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/last_linear/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/last_linear/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "39"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Shape_1", "op": "Shape", "input": ["input_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Shape", "op": "Shape", "input": ["input_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/siren_face_morpher00/Shape_1", "StatefulPartitionedCall/siren_face_morpher00/strided_slice_1/stack", "StatefulPartitionedCall/siren_face_morpher00/strided_slice_1/stack_1", "StatefulPartitionedCall/siren_face_morpher00/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/siren_face_morpher00/Shape", "StatefulPartitionedCall/siren_face_morpher00/strided_slice/stack", "StatefulPartitionedCall/siren_face_morpher00/strided_slice/stack_1", "StatefulPartitionedCall/siren_face_morpher00/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Reshape_2/shape", "op": "Pack", "input": ["StatefulPartitionedCall/siren_face_morpher00/strided_slice", "StatefulPartitionedCall/siren_face_morpher00/strided_slice_1", "StatefulPartitionedCall/siren_face_morpher00/Reshape_2/shape/2", "StatefulPartitionedCall/siren_face_morpher00/Reshape_2/shape/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_1/multiples", "op": "Pack", "input": ["StatefulPartitionedCall/siren_face_morpher00/strided_slice", "StatefulPartitionedCall/siren_face_morpher00/Tile_1/multiples/1", "StatefulPartitionedCall/siren_face_morpher00/Tile_1/multiples/2", "StatefulPartitionedCall/siren_face_morpher00/Tile_1/multiples/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Reshape_2", "op": "Reshape", "input": ["input_1", "StatefulPartitionedCall/siren_face_morpher00/Reshape_2/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_1", "op": "Tile", "input": ["StatefulPartitionedCall/siren_face_morpher00/Reshape_1", "StatefulPartitionedCall/siren_face_morpher00/Tile_1/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Shape_2", "op": "Shape", "input": ["StatefulPartitionedCall/siren_face_morpher00/Tile_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Shape_3", "op": "Shape", "input": ["StatefulPartitionedCall/siren_face_morpher00/Tile_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/siren_face_morpher00/Shape_2", "StatefulPartitionedCall/siren_face_morpher00/strided_slice_2/stack", "StatefulPartitionedCall/siren_face_morpher00/strided_slice_2/stack_1", "StatefulPartitionedCall/siren_face_morpher00/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/siren_face_morpher00/Shape_3", "StatefulPartitionedCall/siren_face_morpher00/strided_slice_3/stack", "StatefulPartitionedCall/siren_face_morpher00/strided_slice_3/stack_1", "StatefulPartitionedCall/siren_face_morpher00/strided_slice_3/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_2/multiples", "op": "Pack", "input": ["StatefulPartitionedCall/siren_face_morpher00/Tile_2/multiples/0", "StatefulPartitionedCall/siren_face_morpher00/Tile_2/multiples/1", "StatefulPartitionedCall/siren_face_morpher00/strided_slice_2", "StatefulPartitionedCall/siren_face_morpher00/strided_slice_3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_2", "op": "Tile", "input": ["StatefulPartitionedCall/siren_face_morpher00/Reshape_2", "StatefulPartitionedCall/siren_face_morpher00/Tile_2/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/siren_face_morpher00/Tile_2", "StatefulPartitionedCall/siren_face_morpher00/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/siren_face_morpher00/Tile_1", "StatefulPartitionedCall/siren_face_morpher00/transpose", "StatefulPartitionedCall/siren_face_morpher00/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/linear/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/siren_face_morpher00/concat", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/linear/Conv2D/ReadVariableOp", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/linear/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/mul", "op": "Mul", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/mul/x", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/linear/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/linear/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/Sin", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/linear/Conv2D/ReadVariableOp", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/linear/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/mul/x", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/linear/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/linear/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/Sin", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/linear/Conv2D/ReadVariableOp", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/linear/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/mul/x", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/linear/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/linear/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/Sin", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/linear/Conv2D/ReadVariableOp", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/linear/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/mul", "op": "Mul", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/mul/x", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/linear/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/linear/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/Sin", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/linear/Conv2D/ReadVariableOp", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/linear/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/mul", "op": "Mul", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/mul/x", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/linear/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/linear/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/Sin", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/linear/Conv2D/ReadVariableOp", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/linear/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/mul", "op": "Mul", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/mul/x", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/linear/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/linear/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/Sin", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/linear/Conv2D/ReadVariableOp", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/linear/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/mul", "op": "Mul", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/mul/x", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/linear/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/linear/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/Sin", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/linear/Conv2D/ReadVariableOp", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/linear/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_host_args": {"i": "0"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/mul", "op": "Mul", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/mul/x", "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/linear/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/last_linear/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/Sin", "StatefulPartitionedCall/siren_face_morpher00/siren/last_linear/Conv2D/ReadVariableOp", "StatefulPartitionedCall/siren_face_morpher00/siren/last_linear/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/siren_face_morpher00/siren/last_linear/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Reshape_2/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Reshape_2/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_2/multiples/0", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_2/multiples/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Reshape_1", "shape": [1, 128, 128, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_1/multiples/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_1/multiples/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/Tile_1/multiples/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_3/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_3/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/strided_slice_3/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/transpose/perm", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/linear/Conv2D/ReadVariableOp", "shape": [1, 1, 41, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.0/linear/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/linear/Conv2D/ReadVariableOp", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.1/linear/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/linear/Conv2D/ReadVariableOp", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.2/linear/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/linear/Conv2D/ReadVariableOp", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.3/linear/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/linear/Conv2D/ReadVariableOp", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.4/linear/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/linear/Conv2D/ReadVariableOp", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.5/linear/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/linear/Conv2D/ReadVariableOp", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.6/linear/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/linear/Conv2D/ReadVariableOp", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/sine_layers.7/linear/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/last_linear/Conv2D/ReadVariableOp", "shape": [1, 1, 128, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/siren_face_morpher00/siren/last_linear/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}]}]}